# подключаем базовый образ от которого будем наследоваться (основа докер-контейнера)
FROM python:3
# задаем рабочую директорию внутри контейнера (набор команд по тому, куда будет осуществляться копирование исходников)
WORKDIR /usr/src/app
# копируем файл в текущую директорию
COPY requirements.txt .
COPY entrypoint.sh .
# ставим все необходимые пакеты для python, которые прописали в файле requirements.txt
RUN pip install -r requirements.txt
# из файла entrypoint.sh делает исполняемый файл
RUN chmod +x entrypoint.sh
# копируем исходники проекта (из текущей директории проекта в рабочую)
COPY . .